trade_exp/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ХозяйственныеОперации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ЗакупкаЧерезПодотчетноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КорректировкаПоСогласованиюСторон</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратНедопоставленногоТовара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ИсправлениеОшибок</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РеализацияПерепоставленногоТовара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПередачаВЭксплуатацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СписаниеТоваровПоТребованию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПрочееПоступлениеДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзДругойКассы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзКассыККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КонвертацияВалюты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтДругойОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПодотчетника</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВнутренняяПередачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПогашениеЗаймаСотрудником</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыОтКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзБанка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ИнкассацияДенежныхСредствИзБанка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствПоКредитам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзДругойОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствПоЗаймамВыданным</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОплатаДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВДругуюКассу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗарплатыРаздатчиком</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗарплатыЧерезКассу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ИнкассацияДенежныхСредствВБанк</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СдачаДенежныхСредствВБанк</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗарплатыРаботнику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВыдачаЗаймов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПрочаяВыдачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОплатаПоКредитам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВКассуККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствПодотчетнику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОплатаПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВыдачаЗаймаСотруднику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыКлиенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РеализацияКлиенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РеализацияБезПереходаПраваСобственности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПередачаНаКомиссию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РеализацияКлиентуРеглУчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПеремещениеТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПриемНаКомиссию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаПоИмпорту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщикаРеглУчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаВСтранахЕАЭС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровОтКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратОтРозничногоПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратОтКомиссионера</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратНеперечисленныхДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыПоПлатежнойКарте</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзКассыНаРасчетныйСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствСДругогоСчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствПоДепозитам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратНеперечисленнойЗарплатыПоЗарплатномуПроекту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщикаТоварыВПути</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщикаФактуровкаПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаПоИмпортуТоварыВПути</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаВСтранахЕАЭСТоварыВПути</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаВСтранахЕАЭСФактуровкаПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПриемНаХранениеСПравомПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПередачаНаКомиссиюВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РеализацияТоваровВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПеремещениеТоваровМеждуФилиалами</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПеречислениеВБюджет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПеречислениеТаможне</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗарплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПеречислениеНаДепозиты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗарплатыПоЗарплатномуПроекту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗарплатыНаЛицевыеСчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="009a4c40-51f5-45e3-8fa7-cddc1609cffe">
    <name>КорректировкаЗадолженности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="af539695-7bf1-4480-85fa-d029bcbfda95">
    <name>ПередачаНаХранениеСПравомПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f675a52b-940a-480e-8374-c64ff49e4478">
    <name>СборкаТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ad2322ce-9ed5-4e79-ace7-6f03b97d9445">
    <name>РазборкаТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="dcf1d7ee-6457-4798-b7be-1fc6c5e5d6db">
    <name>ВозвратТоваровМеждуОрганизациями</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1474589c-3188-43eb-9fcf-9fadfbe18dfb">
    <name>ВозвратПоКомиссииМеждуОрганизациями</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ae5b97e9-6e3e-40da-af52-695ba210a200">
    <name>СписаниеДебиторскойЗадолженности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="733cca42-63ac-4b08-87d9-90abec9c03ec">
    <name>СписаниеКредиторскойЗадолженности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="34640f68-5c62-4ba4-9701-91967a54a881">
    <name>ВозвратТоваровПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="5407710e-c387-4626-8b05-5211234aa07e">
    <name>ВозвратТоваровКомитенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a8eaa96d-0722-48ff-b075-671dd65b442e">
    <name>СписаниеБезнадежнойЗадолженностиЗаСчетРезервовПоСомнительнымДолгам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f786c0b6-6aa3-461f-b4ea-6960515f917b">
    <name>АвансовыйОтчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e17a2118-5315-42ad-bfb7-1c01edf4b364">
    <name>АмортизацияВнеоборотныхАктивов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f23a82e6-6a1f-4f8b-8c71-fb96cdbb1c79">
    <name>АмортизацияНМА</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="705280b7-6490-44c0-a1ca-aa733e68471b">
    <name>АмортизацияНМАвДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e384ae1c-2a54-4267-9a8c-14d48c04e6ed">
    <name>АмортизацияНМАизДругойОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4eefadc1-b52a-4187-8a7a-a4de309e0c59">
    <name>ПоступлениеОплатыОтКлиентаПоПлатежнойКарте</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="15ce947b-5b8c-4087-b372-2f3f60dedd76">
    <name>ОплатаАрендодателю</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="8880d304-daf7-4345-ad8d-c81bc5d994b7">
    <name>РеализацияЧерезКомиссионера</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f24e8e16-21ad-4eeb-a73d-06152c4d9a1e">
    <name>РеализацияЧерезКомиссионераБезПереходаПраваСобственности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="5cb9669e-543b-4d33-b9a2-c6dc788de898">
    <name>ПоставкаПодПринципала</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="5867306d-c3f3-425c-8712-26a7ca164da5">
    <name>ВозвратТоваровЧерезКомиссионера</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="50268f38-df5c-44d6-9a14-6df43baddccf">
    <name>ОказаниеАгентскихУслуг</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="97ecda8f-f5ea-46f4-a56d-6ebe542edcfb">
    <name>КорректировкаПриобретенияУвеличениеЗадолженностиСводно</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ea1805c7-8a38-409a-9c4d-583e9cb111c4">
    <name>КорректировкаПриобретенияУменьшениеЗадолженностиСводно</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="25dbb632-d2cc-4849-b580-b5b34dd542ad">
    <name>КорректировкаРеализацииУвеличениеЗадолженностиСводно</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="63acc8d0-3206-497a-b7cc-098d50049f93">
    <name>КорректировкаРеализацииУменьшениеЗадолженностиСводно</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ТипыРасчетовСПартнерами/ТипыРасчетовСПартнерами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0d6d53c9-63ee-44f8-8520-8cb643b1df21">
  <name>ТипыРасчетовСПартнерами</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="2efefc30-c158-4305-8f41-1131dfd4b818">
    <name>РасчетыСКлиентом</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="115f7bfa-174a-4de6-8149-8a0aa21cb6ea">
    <name>РасчетыСПоставщиком</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ТипыПлатежныхДокументов/ТипыПлатежныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыПлатежныхДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ПлатежноеПоручение</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПлатежныйОрдер</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ИнкассовоеПоручение</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПлатежноеТребование</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/CommonModules/КлиентБанкСервер/Module.bsl
&ИзменениеИКонтроль("ОбновитьДокументы")
Процедура Док_ОбновитьДокументы(ДокументыКЗагрузке, БанковскийСчет, НастройкиЗагрузки)
	
	Перем РеквизитыВсе, РеквизитыХозОперации;
	
	Отбор = Новый Структура("БанковскийСчет, Загружать, НайденДокументВБазе",
		БанковскийСчет, Истина, Истина);
	СтрокиКЗагрузке = ДокументыКЗагрузке.НайтиСтроки(Отбор);
	
	Если СтрокиКЗагрузке.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СоздаватьКонтрагентов = НастройкиЗагрузки.СоздаватьКонтрагентов;
	ПроводитьДокументы = НастройкиЗагрузки.ПроводитьДокументы;
	
	ОчиститьТаблицуСтатейДДС = Ложь;
	
	Если НастройкиЗагрузки.СтатьиДДСОпераций = Неопределено Тогда
		
		ДополнитьНастройкуЗагрузкиСтатьямиДДС(СтрокиКЗагрузке, НастройкиЗагрузки);
		ОчиститьТаблицуСтатейДДС = Истина;
		
	КонецЕсли;
	
	Для каждого СтрокаДокумента Из СтрокиКЗагрузке Цикл
		
		ДокументОбъект = СтрокаДокумента.Документ.ПолучитьОбъект();
		
		СделатьНепроведенным = Ложь;
		
		ВалютаРеглУчета = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ДокументОбъект.Организация);
		
		Отбор = Новый Структура("ХозяйственнаяОперация", ДокументОбъект.ХозяйственнаяОперация);
		ДоступныеСтатьиДДС = НастройкиЗагрузки.СтатьиДДСОпераций.Скопировать(Отбор).ВыгрузитьКолонку("СтатьяДвиженияДенежныхСредств");
		
		УстановитьСвойство(ДокументОбъект, "ПроведеноБанком", Истина);
		УстановитьСвойство(ДокументОбъект, "ДатаПроведенияБанком", СтрокаДокумента.ДатаПроведения);
		
		ЗаменитьСтароеЗначение = Не КлиентБанкЛокализация.ЭтоОперацияОплатыЧерезОнлайнСервис(СтрокаДокумента.Операция);
		
		УстановитьСвойство(ДокументОбъект, "НомерВходящегоДокумента", СтрокаДокумента.Номер, ЗаменитьСтароеЗначение);
		
		Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПоступлениеБезналичныхДенежныхСредств") Тогда
			Документы.ПоступлениеБезналичныхДенежныхСредств.ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(
				ДокументОбъект, РеквизитыВсе, РеквизитыХозОперации);
				
		ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.СписаниеБезналичныхДенежныхСредств") Тогда
			Документы.СписаниеБезналичныхДенежныхСредств.ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(
				ДокументОбъект, РеквизитыВсе, РеквизитыХозОперации);
		КонецЕсли;
		
		// Контрагент
		Если РеквизитыХозОперации.Найти("Контрагент") <> Неопределено И Не ЗначениеЗаполнено(ДокументОбъект.Контрагент) Тогда
			Если ЗначениеЗаполнено(СтрокаДокумента.Контрагент) Тогда
				УстановитьСвойство(ДокументОбъект, "Контрагент", СтрокаДокумента.Контрагент);
			ИначеЕсли СоздаватьКонтрагентов И СтрокаДокумента.СоздаватьКонтрагента Тогда
				УстановитьСвойство(ДокументОбъект, "Контрагент", СоздатьКонтрагента(ДокументыКЗагрузке, СтрокаДокумента));
			Иначе
				УстановитьСвойство(ДокументОбъект, "ИмяКонтрагента", СтрокаДокумента.ИмяКонтрагента);
			КонецЕсли;
		КонецЕсли;
		
		// Счет контрагента
		Если РеквизитыХозОперации.Найти("БанковскийСчетКонтрагента") <> Неопределено И Не ЗначениеЗаполнено(ДокументОбъект.БанковскийСчетКонтрагента) Тогда
			Если ЗначениеЗаполнено(СтрокаДокумента.СчетКонтрагента) Тогда
				УстановитьСвойство(ДокументОбъект, "БанковскийСчетКонтрагента", СтрокаДокумента.СчетКонтрагента);
			ИначеЕсли ЗначениеЗаполнено(ДокументОбъект.Контрагент) Тогда
				УстановитьСвойство(ДокументОбъект, "БанковскийСчетКонтрагента",
				СоздатьБанковскийСчетКонтрагента(ДокументыКЗагрузке, СтрокаДокумента, ДокументОбъект.Контрагент));
			КонецЕсли;
		КонецЕсли;
		
		СуммыРазличаются = (СтрокаДокумента.СуммаДокумента <> ДокументОбъект.СуммаДокумента);
		
		Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.СписаниеБезналичныхДенежныхСредств")
			И ДокументОбъект.ПлатежСКонвертацией Тогда
			УстановитьСвойство(ДокументОбъект, "СуммаВВалютеОтправителя", СтрокаДокумента.СуммаДокумента, Истина);
		Иначе
			УстановитьСвойство(ДокументОбъект, "СуммаДокумента", СтрокаДокумента.СуммаДокумента, Истина);
		КонецЕсли;
		
		Если СуммыРазличаются
			И ДокументОбъект.РасшифровкаПлатежа.Количество() <> 1 Тогда
			
			ДокументОбъект.РасшифровкаПлатежа.Очистить();
			
			Если СтрокаДокумента.Исходящий Тогда
				ЗаполнитьРасшифровкуСписания(СтрокаДокумента, ДокументОбъект, РеквизитыХозОперации, ПроводитьДокументы, ДоступныеСтатьиДДС);
			Иначе
				ЗаполнитьРасшифровкуПоступления(СтрокаДокумента, ДокументОбъект, РеквизитыХозОперации, ПроводитьДокументы, ДоступныеСтатьиДДС);
			КонецЕсли;
			
		Иначе
			
			СтатьяДвиженияДенежныхСредств = ЕдинственнаяСтатьяДвиженияДенежныхСредствИзСписка(ДоступныеСтатьиДДС);
			
			Для каждого СтрокаРасшифровки Из ДокументОбъект.РасшифровкаПлатежа Цикл
				
				// Партнер
				Если Не ЗначениеЗаполнено(СтрокаРасшифровки.Партнер)
					И РеквизитыХозОперации.Найти("РасшифровкаПлатежа.Партнер") <> Неопределено Тогда
					СтрокаРасшифровки.Партнер = СтрокаДокумента.Партнер;
				КонецЕсли;
				
				#Удаление
				Если СтрокаРасшифровки.КурсЧислительВзаиморасчетов = 0
					Или СтрокаРасшифровки.КурсЗнаменательВзаиморасчетов = 0 Тогда
					РаботаСКурсамиВалютУТ.ЗаполнитьКурсДокументаПоУмолчанию(СтрокаРасшифровки.КурсЧислительВзаиморасчетов,
																			СтрокаРасшифровки.КурсЗнаменательВзаиморасчетов,
																			ДокументОбъект.Валюта,
																			СтрокаРасшифровки.ВалютаВзаиморасчетов,
																			ДокументОбъект.Организация,
																			?(ЗначениеЗаполнено(СтрокаДокумента.ДатаПроведения), СтрокаДокумента.ДатаПроведения, ДокументОбъект.Дата),,
																			СтрокаРасшифровки.ОбъектРасчетов);
				КонецЕсли;
				
				// Статья ДДС
				Если РеквизитыХозОперации.Найти("РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств") <> Неопределено
					И Не ЗначениеЗаполнено(СтрокаРасшифровки.СтатьяДвиженияДенежныхСредств) Тогда
					
					Если ЗначениеЗаполнено(СтрокаРасшифровки.ОбъектРасчетов) Тогда
						
						РеквизитыОбъектаРасчетов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
										СтрокаРасшифровки.ОбъектРасчетов,
										"Договор.СтатьяДвиженияДенежныхСредств, Соглашение.СтатьяДвиженияДенежныхСредств");
						
						СтатьяДвиженияДенежныхСредствОбъектаРасчетов = 
							?(ЗначениеЗаполнено(РеквизитыОбъектаРасчетов.ДоговорСтатьяДвиженияДенежныхСредств),
							РеквизитыОбъектаРасчетов.ДоговорСтатьяДвиженияДенежныхСредств,
							РеквизитыОбъектаРасчетов.СоглашениеСтатьяДвиженияДенежныхСредств);
						
						Если ЗначениеЗаполнено(СтатьяДвиженияДенежныхСредствОбъектаРасчетов) Тогда
							СтрокаРасшифровки.СтатьяДвиженияДенежныхСредств =
								?(ЗначениеЗаполнено(РеквизитыОбъектаРасчетов.ДоговорСтатьяДвиженияДенежныхСредств),
								РеквизитыОбъектаРасчетов.ДоговорСтатьяДвиженияДенежныхСредств,
								РеквизитыОбъектаРасчетов.СоглашениеСтатьяДвиженияДенежныхСредств);
						КонецЕсли;
						
					КонецЕсли;
					
					Если Не ЗначениеЗаполнено(СтрокаРасшифровки.СтатьяДвиженияДенежныхСредств)
						И ЗначениеЗаполнено(СтатьяДвиженияДенежныхСредств) Тогда
						СтрокаРасшифровки.СтатьяДвиженияДенежныхСредств = СтатьяДвиженияДенежныхСредств;
					КонецЕсли;
					
				КонецЕсли;
                #КонецУдаления
				
			КонецЦикла;
			
			Если СуммыРазличаются
				И ДокументОбъект.РасшифровкаПлатежа.Количество() = 1 Тогда
				
				СтрокаРасшифровки = ДокументОбъект.РасшифровкаПлатежа[0];
				СтрокаРасшифровки.Сумма = ДокументОбъект.СуммаДокумента;
				
				ДенежныеСредстваКлиентСервер.РассчитатьСуммуВзаиморасчетовВСтрокеРасшифровки(
					СтрокаРасшифровки, ДокументОбъект.Валюта, ВалютаРеглУчета);
					
				СтруктураПересчетаСуммы = Новый Структура;
				СтруктураПересчетаСуммы.Вставить("ЦенаВключаетНДС", Истина);
				СтруктураДействий = Новый Структура;
				СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
				ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаРасшифровки, СтруктураДействий, Неопределено);
				
			КонецЕсли;
			
		КонецЕсли;
		
		УстановитьСвойство(ДокументОбъект, "НазначениеПлатежа", СтрокаДокумента.НазначениеПлатежа, Истина);
		УстановитьСвойство(ДокументОбъект, "ФорматированноеНазначениеПлатежа", СтрокаДокумента.ФорматированноеНазначениеПлатежа, Истина);
		УстановитьСвойство(ДокументОбъект, "ДанныеВыписки", СтрокаДокумента.ДанныеВыписки, Истина);
		
		УстановитьСвойство(ДокументОбъект, "Комментарий", СтрокаДокумента.Комментарий);
		
		Если ДокументОбъект.Модифицированность() Тогда
			УстановитьСвойство(ДокументОбъект, "ДатаЗагрузки", ТекущаяДатаСеанса(), Истина);
		КонецЕсли;
		
		ДокументОбъект.ДополнительныеСвойства.Вставить("ОбменСБанками", Истина);
		ДокументОбъект.Движения.ДенежныеСредстваБезналичные.ДополнительныеСвойства.Вставить("ОбменСБанками", Истина);
		ДокументОбъект.ПроверитьЗаполнение();
		
		Если ДокументОбъект.ДополнительныеСвойства.Свойство("ОшибкиЗаполнения") Тогда
			УстановитьСвойство(ДокументОбъект, "ОшибкиЗагрузки", ДокументОбъект.ДополнительныеСвойства.ОшибкиЗаполнения, Истина);
		КонецЕсли;
		
		Если ПроводитьДокументы
			И СокрЛП(ДокументОбъект.ОшибкиЗагрузки) = "" Тогда
			РежимЗаписи = РежимЗаписиДокумента.Проведение;
		Иначе
			
			РежимЗаписи = РежимЗаписиДокумента.Запись;
			
			Если СокрЛП(ДокументОбъект.ОшибкиЗагрузки) <> "" Тогда
				СделатьНепроведенным = ДокументОбъект.Проведен;
			КонецЕсли;
			
		КонецЕсли;
		
		Если СуммыРазличаются Тогда
			ДобавитьЗамечание(СтрокаДокумента.ОшибкиЗагрузки, НСтр("ru = 'Изменилась сумма документа'"));
		КонецЕсли;
		
		ЗаписатьОбъект(ДокументОбъект, ?(СделатьНепроведенным, РежимЗаписиДокумента.ОтменаПроведения, РежимЗаписи), СтрокаДокумента);
	КонецЦикла;
	
	Если ОчиститьТаблицуСтатейДДС Тогда
		НастройкиЗагрузки.СтатьиДДСОпераций = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьРеквизитыПоступления")
Процедура Док_ЗаполнитьРеквизитыПоступления(ДокументыКЗагрузке, СтрокаДокумента, ДокументОбъект, СоздаватьКонтрагентов, ПроводитьДокументы, ДоступныеСтатьиДДС)
	
	Перем РеквизитыВсе, РеквизитыХозОперации;
	
	Документы.ПоступлениеБезналичныхДенежныхСредств.ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(
		ДокументОбъект, РеквизитыВсе, РеквизитыХозОперации);
	
	ВалютаРеглУчета = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ДокументОбъект.Организация);
	
	// Контрагент
	Если РеквизитыХозОперации.Найти("Контрагент") <> Неопределено Тогда
		Если ЗначениеЗаполнено(СтрокаДокумента.Контрагент) Тогда
			УстановитьСвойство(ДокументОбъект, "Контрагент", СтрокаДокумента.Контрагент);
		ИначеЕсли СоздаватьКонтрагентов И СтрокаДокумента.СоздаватьКонтрагента Тогда
			УстановитьСвойство(ДокументОбъект, "Контрагент", СоздатьКонтрагента(ДокументыКЗагрузке, СтрокаДокумента));
		Иначе
			УстановитьСвойство(ДокументОбъект, "ИмяКонтрагента", СтрокаДокумента.ИмяКонтрагента);
		КонецЕсли;
	КонецЕсли;
	
	// Счет контрагента
	Если РеквизитыХозОперации.Найти("БанковскийСчетКонтрагента") <> Неопределено Тогда
		Если ЗначениеЗаполнено(СтрокаДокумента.СчетКонтрагента) Тогда
			УстановитьСвойство(ДокументОбъект, "БанковскийСчетКонтрагента", СтрокаДокумента.СчетКонтрагента);
		ИначеЕсли ЗначениеЗаполнено(ДокументОбъект.Контрагент) Тогда
			УстановитьСвойство(ДокументОбъект, "БанковскийСчетКонтрагента",
				СоздатьБанковскийСчетКонтрагента(ДокументыКЗагрузке, СтрокаДокумента, ДокументОбъект.Контрагент));
		КонецЕсли;
	КонецЕсли;
	
	// Подотчетное лицо
	Если РеквизитыХозОперации.Найти("ПодотчетноеЛицо") <> Неопределено Тогда
		Если СтрокаДокумента.НайденКонтрагент Тогда
			УстановитьСвойство(ДокументОбъект, "ПодотчетноеЛицо", СтрокаДокумента.Контрагент);
		Иначе
			УстановитьСвойство(ДокументОбъект, "ПодотчетноеЛицо", СтрокаДокумента.ПодотчетноеЛицо);
		КонецЕсли;
	КонецЕсли;
	
	// Банковский счет отправитель
	Если РеквизитыХозОперации.Найти("БанковскийСчетОтправитель") <> Неопределено Тогда
		УстановитьСвойство(ДокументОбъект, "БанковскийСчетОтправитель", СтрокаДокумента.СчетКонтрагента);
	КонецЕсли;
	
	// Прочие реквизиты
	ЗаполнитьЗначенияСвойств(ДокументОбъект, СтрокаДокумента,
		"СтатьяДвиженияДенежныхСредств, Подразделение, КассаОтправитель");
	
	// Поступление оплаты по эквайрингу
	Если РеквизитыХозОперации.Найти("ДоговорЭквайринга") <> Неопределено Тогда
		
		Если Не ЗначениеЗаполнено(СтрокаДокумента.ДоговорЭквайринга) Тогда
			
			СпособПроведенияПлатежа = Неопределено;
			
			Если СтрокаДокумента.ЭтоСБП Тогда
				СпособПроведенияПлатежа = Перечисления.СпособыПроведенияПлатежей.СистемаБыстрыхПлатежей;
			КонецЕсли;
			
			ПараметрыОтбора = Справочники.ДоговорыЭквайринга.ПараметрыОтбораДоговораЭквайринга();
		
			ПараметрыОтбора.Организация = ДокументОбъект.Организация;
			ПараметрыОтбора.Эквайер = ДокументОбъект.Контрагент;
			ПараметрыОтбора.БанковскийСчет = ДокументОбъект.БанковскийСчет;
			ПараметрыОтбора.СпособПроведенияПлатежа = СпособПроведенияПлатежа;
			
			СтрокаДокумента.ДоговорЭквайринга = Справочники.ДоговорыЭквайринга.ДоговорЭквайрингаПоУмолчанию(ПараметрыОтбора);
			
		КонецЕсли;
		
		ЗаполнитьПоДоговоруПодключения(СтрокаДокумента, ДокументОбъект, ДоступныеСтатьиДДС);
		
	КонецЕсли;
	
	КлиентБанкЛокализация.ЗаполнитьРеквизитыПоступления(СтрокаДокумента, ДокументОбъект);
	
	// Расшифровка платежа
	ЗаполнитьРасшифровкуПоступления(СтрокаДокумента, ДокументОбъект, РеквизитыХозОперации, ПроводитьДокументы, ДоступныеСтатьиДДС);
	
	Если СтрокаДокумента.СуммаКонвертации <> 0 Тогда
		
		УстановитьСвойство(ДокументОбъект, "СуммаКонвертации", СтрокаДокумента.СуммаКонвертации, Истина);
		ДенежныеСредстваСервер.ПересчитатьПараметрыКонвертации(ДокументОбъект, ВалютаРеглУчета, "СуммаКонвертации");
		
	КонецЕсли;
	
	КлиентБанкЛокализация.ЗаполнитьКодВалютнойОперации(ДокументОбъект);
    #Вставка
	//ЛенВставитьПараметр
	Обработки.КлиентБанк.ЗаполнитьОснованиеПлатежа(ДокументОбъект, СтрокаДокумента, "Поступление", ПроводитьДокументы);
	Если ЗначениеЗаполнено(СтрокаДокумента.ВидОперации) Тогда
	ХозяйственнаяОперация = СтрокаДокумента.ВидОперации;
	Иначе
		ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоставщику;
	КонецЕсли;		
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента Тогда
		ДатаПоступления = НачалоДня(ОбщегоНазначенияКлиентСервер.СтрокаВДату(СтрокаДокумента.ДатаПоступило)); 
		Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента И ДатаПоступления = НачалоДня(ТекущаяДатаСеанса()) И ДокументОбъект.Дата < ДатаПоступления Тогда
			ДокументОбъект.Дата = НачалоДня(ДатаПоступления)+60*60*8;  
		КонецЕсли;	
	КонецЕсли;	
	#КонецВставки
	
КонецПроцедуры

&ИзменениеИКонтроль("ЗаписатьОбъект")
Процедура Док_ЗаписатьОбъект(ОбъектДляЗаписи, РежимЗаписи, СтрокаДокумента) Экспорт

	ОбъектМодифицирован = ОбъектДляЗаписи.Модифицированность();
	ОбъектПроведен      = ОбъектДляЗаписи.Проведен;
	Проводить = (РежимЗаписи = РежимЗаписиДокумента.Проведение Или ОбъектПроведен И РежимЗаписи = РежимЗаписиДокумента.Запись);

	Если ОбъектМодифицирован
		И Не Проводить Тогда
		Попытка
			ОбъектДляЗаписи.Записать(РежимЗаписи);
		Исключение

			ОписаниеОшибки = ИнформацияОбОшибке();
			ВывестиОшибкуЗаписи(ОбъектДляЗаписи, ОписаниеОшибки, СтрокаДокумента.ОшибкиЗагрузки);
			Возврат;

		КонецПопытки;
	КонецЕсли;

	Если Проводить И (ОбъектМодифицирован Или НЕ ОбъектПроведен) Тогда

		// Сохранение расшифровки платежа до проведения
		КопияРасшифровкиПлатежа = Неопределено;

		Если ОбъектДляЗаписи.РасшифровкаПлатежа.Количество() > 0 Тогда
			КопияРасшифровкиПлатежа = ОбъектДляЗаписи.РасшифровкаПлатежа.Выгрузить();
		КонецЕсли;

		Попытка
			ОбъектДляЗаписи.Записать(РежимЗаписиДокумента.Проведение);
		Исключение

			ОписаниеОшибки = ИнформацияОбОшибке();
			ТекстОшибки = НСтр("ru = '%1
			|Произошли ошибки при проведении!'");

			ПодробноеОписаниеОшибки = СформироватьОписаниеОшибкиЗаписиДокумента(ОписаниеОшибки);
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстОшибки,
			ПодробноеОписаниеОшибки);
			ЗаписатьОшибкуИзмененияДокументаВЖурнал(ОбъектДляЗаписи, ОбъектДляЗаписи.Ссылка, Комментарий);

			Если ОписаниеОшибки.Причина <> Неопределено Тогда
				ДобавитьЗамечание(СтрокаДокумента.ОшибкиЗагрузки, ПодробноеОписаниеОшибки);
			КонецЕсли;

		КонецПопытки;

		Если Не ОбъектДляЗаписи.Проведен Тогда

			// Восстановление расшифровки платежа до проведения в случае ошибки проведения,
			// т.к. во время записи объекта создается и заполняется объект расчетов в табличную часть,
			// а после отката транзакции остается ссылка, не существующего объекта расчетов ("битая ссылка").
			Если КопияРасшифровкиПлатежа <> Неопределено Тогда
				ОбъектДляЗаписи.РасшифровкаПлатежа.Загрузить(КопияРасшифровкиПлатежа);
			КонецЕсли;

			Попытка
				ОбъектДляЗаписи.Записать(РежимЗаписиДокумента.Запись);
			Исключение
				ОписаниеОшибки = ИнформацияОбОшибке();
				ВывестиОшибкуЗаписи(ОбъектДляЗаписи, ОписаниеОшибки, СтрокаДокумента.ОшибкиЗагрузки);
			КонецПопытки;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("СобственныеСчета")
Функция Док_СобственныеСчета(БанковскийСчет) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	БанковскиеСчета.Ссылка КАК Ссылка,
	|	БанковскиеСчета.НомерСчета КАК НомерСчета,
	|	БанковскиеСчета.ВалютаДенежныхСредств КАК Валюта,
	|	ВЫБОР
	|		КОГДА БанковскиеСчета.РучноеИзменениеРеквизитовБанка ТОГДА
	|			БанковскиеСчета.БИКБанка
	|		ИНАЧЕ
	|			БанковскиеСчета.Банк.Код
	|	КОНЕЦ КАК БИК,
	|	ВЫБОР
	|		КОГДА БанковскиеСчета.РучноеИзменениеРеквизитовБанка ТОГДА
	|			БанковскиеСчета.СВИФТБанка
	|		ИНАЧЕ
	|			БанковскиеСчета.Банк.СВИФТБИК
	|	КОНЕЦ КАК СВИФТ
	|ИЗ
	|	Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчета
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
	|	ПО
	|		БанковскиеСчетаОрганизаций.Владелец = БанковскиеСчета.Владелец
	|		И БанковскиеСчетаОрганизаций.Ссылка = &БанковскийСчет
	|	
	|ГДЕ
	|	БанковскиеСчета.Ссылка <> &БанковскийСчет
	|	И НЕ БанковскиеСчета.ПометкаУдаления
	|";

	Запрос.УстановитьПараметр("БанковскийСчет", БанковскийСчет);

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

&ИзменениеИКонтроль("ЗаполнитьОснованиеПлатежейПоУИП")
Процедура Док_ЗаполнитьОснованиеПлатежейПоУИП(ДокументыКЗагрузке, ТаблицаДокументов, БанковскийСчет) Экспорт

	СпискиУИП = РазделенныйСписокУИП(ТаблицаДокументов);

	Если СпискиУИП.УИПРасчетовСКлиентами.Количество() <> 0 Тогда
		ЗаполнитьПлатежиКЗагрузкеПоУИП(Ложь, БанковскийСчет, ДокументыКЗагрузке, СпискиУИП.УИПРасчетовСКлиентами);
	КонецЕсли;

	Если СпискиУИП.УИПРасчетовСПоставщиками.Количество() <> 0 Тогда

		ЗаполнитьПлатежиКЗагрузкеПоУИП(Истина, БанковскийСчет, ДокументыКЗагрузке, СпискиУИП.УИПРасчетовСПоставщиками);
		КлиентБанкЛокализация.УстановитьПризнакРасчетаССамозанятымПоОбъектуРасчета(ДокументыКЗагрузке);

	КонецЕсли;

	Если СпискиУИП.УИПКонвертации.Количество() <> 0 Тогда

		ДанныеДокументов = ДенежныеСредстваСервер.ОснованияОперацииКонвертацииПоУИП(
		СпискиУИП.УИПКонвертации.ВыгрузитьКолонку("Код"), ТекущаяДатаСеанса());

		Для Каждого ТекущиеДанные Из ДанныеДокументов Цикл

			ОтборИдентификатора = Новый Структура;
			ОтборИдентификатора.Вставить("Код", ТекущиеДанные.ИдентификаторПлатежа);
			СтрокиДокументов = ДокументыКЗагрузке.НайтиСтроки(ОтборИдентификатора);

			Для Каждого СтрокаДокумента Из СтрокиДокументов Цикл

				СтрокаДокумента.НайденоОснованиеПлатежа = Истина;
				СтрокаДокумента.НайденКонтрагент = Истина;
				СтрокаДокумента.СоздаватьКонтрагента = Ложь;

				ЗаполнитьЗначенияСвойств(
				СтрокаДокумента,
				ТекущиеДанные, 
				"Контрагент, Партнер, ОснованиеПлатежа, Подразделение, СтатьяДвиженияДенежныхСредств, ВалютаКонвертации, СуммаКонвертации");
				СтрокаДокумента.ВидОперации = Перечисления.ХозяйственныеОперации.КонвертацияВалюты;

			КонецЦикла;

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьКассовыйДокумент")
Процедура Док_ЗаполнитьКассовыйДокумент(ДокументыКЗагрузке, ТаблицаДокументов, БанковскийСчет, Исходящие) Экспорт

	Если Не ТаблицаДокументов.Количество() Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаДокументов.НомерСтроки,
	|	ТаблицаДокументов.ДатаПроведения,
	|	ТаблицаДокументов.СуммаДокумента
	|
	|ПОМЕСТИТЬ ТаблицаДокументов
	|
	|ИЗ
	|	&ТаблицаДокументов КАК ТаблицаДокументов
	|";

	Запрос.УстановитьПараметр("ТаблицаДокументов", ТаблицаДокументов);
	Запрос.Выполнить();

	Если Исходящие Тогда

		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ТаблицаДокументов.НомерСтроки КАК НомерСтроки,
		|	ДанныеДокумента.Ссылка КАК Ссылка
		|ИЗ
		|	ТаблицаДокументов
		|	
		|	ЛЕВОЕ СОЕДИНЕНИЕ
		|		Документ.ПриходныйКассовыйОрдер КАК ДанныеДокумента
		|	ПО
		|		ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзБанка)
		|		И ДанныеДокумента.БанковскийСчет = &БанковскийСчет
		|		И НАЧАЛОПЕРИОДА(ДанныеДокумента.Дата, ДЕНЬ) = ТаблицаДокументов.ДатаПроведения
		|		И ДанныеДокумента.СуммаДокумента = ТаблицаДокументов.СуммаДокумента
		|		И ДанныеДокумента.Проведен
		|ГДЕ
		|	НЕ ДанныеДокумента.Ссылка ЕСТЬ NULL
		|";

	Иначе

		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ТаблицаДокументов.НомерСтроки КАК НомерСтроки,
		|	ДанныеДокумента.Ссылка КАК Ссылка
		|ИЗ
		|	ТаблицаДокументов
		|	
		|	ЛЕВОЕ СОЕДИНЕНИЕ
		|		Документ.РасходныйКассовыйОрдер КАК ДанныеДокумента
		|	ПО
		|		ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СдачаДенежныхСредствВБанк)
		|		И ДанныеДокумента.БанковскийСчет = &БанковскийСчет
		|		И НАЧАЛОПЕРИОДА(ДанныеДокумента.Дата, ДЕНЬ) = ТаблицаДокументов.ДатаПроведения
		|		И ДанныеДокумента.СуммаДокумента = ТаблицаДокументов.СуммаДокумента
		|		И ДанныеДокумента.Проведен
		|ГДЕ
		|	НЕ ДанныеДокумента.Ссылка ЕСТЬ NULL
		|";

	КонецЕсли;

	Запрос.Текст = ТекстЗапроса;

	Запрос.УстановитьПараметр("БанковскийСчет", БанковскийСчет);
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		СтрокаДокумента = ДокументыКЗагрузке.Найти(Выборка.НомерСтроки, "НомерСтроки");
		Если СтрокаДокумента <> Неопределено Тогда
			СтрокаДокумента.КассовыйДокумент = Выборка.Ссылка;
			СтрокаДокумента.Загружать = Ложь;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьПоКосвеннымДанным")
Процедура Док_ЗаполнитьПоКосвеннымДанным(СтрокиКЗагрузке, БанковскийСчет) Экспорт

	Если СтрокиКЗагрузке.Количество() <> 0 Тогда

		Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(БанковскийСчет, "Владелец");
		МассивВзаимосвязанныхОрганизаций = Справочники.Организации.МассивВзаимосвязанныхОрганизаций(Организация);

		СтрокаТаблицы = СтрокиКЗагрузке.Получить(0);
		ТаблицаКЗагрузке = СтрокаТаблицы.Владелец();
		КонтрагентыИСчета = ТаблицаКЗагрузке.Скопировать(СтрокиКЗагрузке, "Контрагент, СчетКонтрагента");
		КонтрагентыИСчета.Свернуть("Контрагент, СчетКонтрагента");

		ОбъектыРасчетовПоДоговорам = СписокОбъектовРасчетовПоДоговорам(БанковскийСчет, Организация, КонтрагентыИСчета);
		ОбъектыРасчетовПоДоговорам.Индексы.Добавить("Контрагент, СчетКонтрагента");

		ДоговорыКредитовДепозитов = СписокДоговоровКредитовДепозитов(БанковскийСчет, КонтрагентыИСчета);
		ДоговорыКредитовДепозитов.Индексы.Добавить("Контрагент, СчетКонтрагента");

	КонецЕсли;

	Для каждого СтрокаДокумента Из СтрокиКЗагрузке Цикл

		Если Не ЗначениеЗаполнено(СтрокаДокумента.ВидОперации) И ТипЗнч(СтрокаДокумента.Контрагент) = Тип("СправочникСсылка.Организации") Тогда // Собственная организация

			Если МассивВзаимосвязанныхОрганизаций.Найти(СтрокаДокумента.Контрагент) <> Неопределено Тогда
				СтрокаДокумента.ВидОперации = Перечисления.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств;
			Иначе

				Если СтрокаДокумента.Исходящий Тогда
					СтрокаДокумента.ВидОперации = Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию;
				Иначе
					СтрокаДокумента.ВидОперации = Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойОрганизации;
				КонецЕсли;

			КонецЕсли;

			Продолжить;
		КонецЕсли;

		ПараметрыОтбора = Новый Структура ("Контрагент, СчетКонтрагента");
		ЗаполнитьЗначенияСвойств(ПараметрыОтбора, СтрокаДокумента);

		// Договор кредита/депозита
		НайденныеДоговорыКредитовДепозитов = ДоговорыКредитовДепозитов.НайтиСтроки(ПараметрыОтбора);

		Если НайденныеДоговорыКредитовДепозитов.Количество() = 1 Тогда

			Выборка = НайденныеДоговорыКредитовДепозитов.Получить(0);
			СтрокаДокумента.ДоговорКредитаДепозита = Выборка.Ссылка;
			СтрокаДокумента.ВидОперации = Справочники.ДоговорыКредитовИДепозитов.ОперацияПоХарактеруДоговора(
			Выборка.ХарактерДоговора,
			Не СтрокаДокумента.Исходящий);
			СтрокаДокумента.ВалютаВзаиморасчетов = Выборка.ВалютаВзаиморасчетов;
			Если Выборка.ХарактерДоговора = Перечисления.ХарактерыДоговоровФинансовыхИнструментов.КредитИлиЗайм Тогда

				Если СтрокаДокумента.Исходящий Тогда
					СтрокаДокумента.СтатьяДвиженияДенежныхСредств = Выборка.СтатьяДДС;
					СтрокаДокумента.ТипСуммыКредитаДепозита = Выборка.ТипСуммыКредитаДепозита;
				Иначе
					СтрокаДокумента.СтатьяДвиженияДенежныхСредств = Выборка.СтатьяДДСПоступленияВыдачи;
				КонецЕсли;

			Иначе

				Если СтрокаДокумента.Исходящий Тогда
					СтрокаДокумента.СтатьяДвиженияДенежныхСредств = Выборка.СтатьяДДСПоступленияВыдачи;
				Иначе
					СтрокаДокумента.СтатьяДвиженияДенежныхСредств = Выборка.СтатьяДДС;
					СтрокаДокумента.ТипСуммыКредитаДепозита = Выборка.ТипСуммыКредитаДепозита;
				КонецЕсли;

			КонецЕсли;

			Продолжить;

		КонецЕсли;

		// Договор с контрагентом
		Если Не ЗначениеЗаполнено(СтрокаДокумента.ОбъектРасчетов) Тогда

			ДополнитьПараметрыОтбораДоговора(ПараметрыОтбора);

			Если СтрокаДокумента.Исходящий Тогда
				ПараметрыОтбора.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком;
			КонецЕсли;

			ЗаполнитьОбъектРасчетовПлатежаПоДоговору(СтрокаДокумента, ОбъектыРасчетовПоДоговорам, ПараметрыОтбора);

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьОбразцы")
Процедура Док_ЗаполнитьОбразцы(СтрокиКЗагрузке, БанковскийСчет) Экспорт

	РеквизитыХозОперацийПоступления = РеквизитыХозОперацийПоступления();
	РеквизитыХозОперацийСписания = РеквизитыХозОперацийСписания();

	Запрос = Новый Запрос;

	ТекстЗапросаВходящие = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДанныеДокумента.Ссылка                          КАК Ссылка,
	|	ДанныеДокумента.ХозяйственнаяОперация           КАК ХозяйственнаяОперация,
	|	ТабЧасть.СтатьяДвиженияДенежныхСредств          КАК РасшифровкаПлатежаСтатьяДвиженияДенежныхСредств,
	|	ДанныеДокумента.СтатьяДвиженияДенежныхСредств   КАК СтатьяДвиженияДенежныхСредств,
	|	ДанныеДокумента.ПодотчетноеЛицо                 КАК ПодотчетноеЛицо,
	|	ДанныеДокумента.КассаОтправитель                КАК КассаОтправитель,
	|	ТабЧасть.Подразделение                          КАК РасшифровкаПлатежаПодразделение,
	|	ДанныеДокумента.Подразделение                   КАК Подразделение,
	|	ТабЧасть.СтатьяДоходов                          КАК РасшифровкаПлатежаСтатьяДоходов,
	|	ТабЧасть.АналитикаДоходов                       КАК РасшифровкаПлатежаАналитикаДоходов,
	|	ТабЧасть.АналитикаАктивовПассивов               КАК РасшифровкаПлатежаАналитикаАктивовПассивов,
	|	ДанныеДокумента.ДоговорЭквайринга               КАК ДоговорЭквайринга,
	|	ДанныеДокумента.СтатьяРасходов                  КАК СтатьяРасходов,
	|	ДанныеДокумента.АналитикаРасходов               КАК АналитикаРасходов,
	|	ДанныеДокумента.ТипНалога                       КАК ТипНалога,
	|	ДанныеДокумента.НастройкаСчетовУчета            КАК НастройкаСчетовУчета,
	|	ДанныеДокумента.ИдентификаторПлатежа            КАК ИдентификаторПлатежа
	|	
	|ИЗ
	|	Документ.ПоступлениеБезналичныхДенежныхСредств КАК ДанныеДокумента
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ТабЧасть
	|	ПО
	|		ТабЧасть.Ссылка = ДанныеДокумента.Ссылка
	|	
	|ГДЕ
	|	&Условие
	|	
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Дата УБЫВ
	|";

	ТекстЗапросаИсходящие = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДанныеДокумента.Ссылка                          КАК Ссылка,
	|	ДанныеДокумента.ХозяйственнаяОперация           КАК ХозяйственнаяОперация,
	|	ТабЧасть.СтатьяДвиженияДенежныхСредств          КАК РасшифровкаПлатежаСтатьяДвиженияДенежныхСредств,
	|	ДанныеДокумента.СтатьяДвиженияДенежныхСредств   КАК СтатьяДвиженияДенежныхСредств,
	|	ДанныеДокумента.ПодотчетноеЛицо                 КАК ПодотчетноеЛицо,
	|	ДанныеДокумента.КассаПолучатель                 КАК КассаПолучатель,
	|	ТабЧасть.Подразделение                          КАК РасшифровкаПлатежаПодразделение,
	|	ДанныеДокумента.Подразделение                   КАК Подразделение,
	|	ТабЧасть.СтатьяРасходов                         КАК РасшифровкаПлатежаСтатьяРасходов,
	|	ТабЧасть.АналитикаРасходов                      КАК РасшифровкаПлатежаАналитикаРасходов,
	|	ТабЧасть.АналитикаАктивовПассивов               КАК РасшифровкаПлатежаАналитикаАктивовПассивов,
	|	ДанныеДокумента.ДоговорЭквайринга               КАК ДоговорЭквайринга,
	|	ДанныеДокумента.СтатьяРасходов                  КАК СтатьяРасходов,
	|	ДанныеДокумента.АналитикаРасходов               КАК АналитикаРасходов,
	|	ДанныеДокумента.ТипНалога                       КАК ТипНалога,
	|	ДанныеДокумента.НастройкаСчетовУчета            КАК НастройкаСчетовУчета,
	|	ДанныеДокумента.ИдентификаторПлатежа            КАК ИдентификаторПлатежа
	|	
	|ИЗ
	|	Документ.СписаниеБезналичныхДенежныхСредств КАК ДанныеДокумента
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Документ.СписаниеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ТабЧасть
	|	ПО
	|		ТабЧасть.Ссылка = ДанныеДокумента.Ссылка
	|	
	|ГДЕ
	|	&Условие
	|	
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Дата УБЫВ
	|";

	Запрос.УстановитьПараметр("БанковскийСчет", БанковскийСчет);

	// Шаг 1. Поиск по счету отправителя, получателя, назначению платежа
	УсловиеИсходящие = "
	|	ДанныеДокумента.БанковскийСчет = &БанковскийСчет
	|	И (ДанныеДокумента.БанковскийСчетКонтрагента = &СчетКонтрагента
	|		ИЛИ ДанныеДокумента.БанковскийСчетПолучатель = &СчетКонтрагента)
	|	И ДанныеДокумента.ФорматированноеНазначениеПлатежа = &ФорматированноеНазначениеПлатежа
	|	И ДанныеДокумента.Проведен
	|";

	УсловиеВходящие = "
	|	ДанныеДокумента.БанковскийСчет = &БанковскийСчет
	|	И (ДанныеДокумента.БанковскийСчетКонтрагента = &СчетКонтрагента
	|		ИЛИ ДанныеДокумента.БанковскийСчетОтправитель = &СчетКонтрагента
	|		ИЛИ (ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыПоПлатежнойКарте)
	|			И ДанныеДокумента.Контрагент = &Контрагент))
	|	И ДанныеДокумента.ФорматированноеНазначениеПлатежа = &ФорматированноеНазначениеПлатежа
	|	И ДанныеДокумента.Проведен
	|";

	СтрокиПоискаШаг2 = Новый Массив;
	Для каждого СтрокаДокумента Из СтрокиКЗагрузке Цикл

		Если СтрокаДокумента.Исходящий Тогда
			Запрос.Текст = ТекстЗапросаИсходящие;
			ТекстУсловия = УсловиеИсходящие;
			Реквизиты = РеквизитыХозОперацийСписания;
		Иначе
			Запрос.Текст = ТекстЗапросаВходящие;
			ТекстУсловия = УсловиеВходящие;
			Реквизиты = РеквизитыХозОперацийПоступления;
		КонецЕсли;

		Если ЗначениеЗаполнено(СтрокаДокумента.ВидОперации) Тогда
			ТекстУсловия = ТекстУсловия + "
			|	И ДанныеДокумента.ХозяйственнаяОперация = &ХозяйственнаяОперация";
			Запрос.УстановитьПараметр("ХозяйственнаяОперация", СтрокаДокумента.ВидОперации);
		КонецЕсли;

		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условие", ТекстУсловия);

		Если Запрос.НайтиПараметры().Найти("Контрагент") <> Неопределено Тогда
			Запрос.УстановитьПараметр("Контрагент", СтрокаДокумента.Контрагент);
		КонецЕсли;

		Запрос.УстановитьПараметр("СчетКонтрагента", СтрокаДокумента.СчетКонтрагента);
		Запрос.УстановитьПараметр("ФорматированноеНазначениеПлатежа", СтрокаДокумента.ФорматированноеНазначениеПлатежа);

		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда

			НаборРеквизитов = Реквизиты.Получить(Выборка.ХозяйственнаяОперация);
			Если НаборРеквизитов <> Неопределено Тогда

				ЗаполнитьЗначенияСвойств(НаборРеквизитов, Выборка);

				Если ПоискКорректен(СтрокаДокумента, Выборка, НаборРеквизитов, ТекстУсловия) Тогда

					СтрокаДокумента.НайденОбразец = Истина;
					СтрокаДокумента.Образец = Выборка.Ссылка;
					СтрокаДокумента.ВидОперации = Выборка.ХозяйственнаяОперация;

					Для каждого Реквизит Из НаборРеквизитов Цикл
						Если Не ЗначениеЗаполнено(Реквизит.Значение) Тогда
							Продолжить;
						КонецЕсли;
						Если СтрНайти(Реквизит.Ключ, "РасшифровкаПлатежа") Тогда
							ИмяРеквизита = Сред(Реквизит.Ключ, СтрДлина("РасшифровкаПлатежа") + 1);
						Иначе
							ИмяРеквизита = Реквизит.Ключ;
						КонецЕсли;
						СтрокаДокумента[ИмяРеквизита] = Реквизит.Значение;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		Иначе
			СтрокиПоискаШаг2.Добавить(СтрокаДокумента);
		КонецЕсли;
	КонецЦикла;

	Если Не СтрокиПоискаШаг2.Количество() Тогда
		Возврат;
	КонецЕсли;

	// Шаг 2. Поиск по счету отправителя, получателя, без учета назначения платежа
	УсловиеИсходящие = "
	|	ДанныеДокумента.БанковскийСчет = &БанковскийСчет
	|	И (ДанныеДокумента.БанковскийСчетКонтрагента = &СчетКонтрагента
	|		ИЛИ ДанныеДокумента.БанковскийСчетПолучатель = &СчетКонтрагента)
	|	И ДанныеДокумента.Проведен
	|";

	УсловиеВходящие = "
	|	ДанныеДокумента.БанковскийСчет = &БанковскийСчет
	|	И (ДанныеДокумента.БанковскийСчетКонтрагента = &СчетКонтрагента
	|		ИЛИ ДанныеДокумента.БанковскийСчетОтправитель = &СчетКонтрагента
	|		ИЛИ (ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыПоПлатежнойКарте)
	|			И ДанныеДокумента.Контрагент = &Контрагент))
	|	И ДанныеДокумента.Проведен
	|";

	СтрокиПоискаШаг3 = Новый Массив;
	Для каждого СтрокаДокумента Из СтрокиПоискаШаг2 Цикл

		Если СтрокаДокумента.Исходящий Тогда
			Запрос.Текст = ТекстЗапросаИсходящие;
			ТекстУсловия = УсловиеИсходящие;
			Реквизиты = РеквизитыХозОперацийСписания;
		Иначе
			Запрос.Текст = ТекстЗапросаВходящие;
			ТекстУсловия = УсловиеВходящие;
			Реквизиты = РеквизитыХозОперацийПоступления;
		КонецЕсли;

		Если ЗначениеЗаполнено(СтрокаДокумента.ВидОперации) Тогда
			ТекстУсловия = ТекстУсловия + "
			|	И ДанныеДокумента.ХозяйственнаяОперация = &ХозяйственнаяОперация";
			Запрос.УстановитьПараметр("ХозяйственнаяОперация", СтрокаДокумента.ВидОперации);
		КонецЕсли;

		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условие", ТекстУсловия);

		Запрос.УстановитьПараметр("СчетКонтрагента", СтрокаДокумента.СчетКонтрагента);
		Если Запрос.НайтиПараметры().Найти("Контрагент") <> Неопределено Тогда
			Запрос.УстановитьПараметр("Контрагент", СтрокаДокумента.Контрагент);
		КонецЕсли;

		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда

			НаборРеквизитов = Реквизиты.Получить(Выборка.ХозяйственнаяОперация);
			Если НаборРеквизитов <> Неопределено Тогда

				ЗаполнитьЗначенияСвойств(НаборРеквизитов, Выборка);

				Если ПоискКорректен(СтрокаДокумента, Выборка, НаборРеквизитов, ТекстУсловия) Тогда

					СтрокаДокумента.НайденОбразец = Истина;
					СтрокаДокумента.Образец = Выборка.Ссылка;
					СтрокаДокумента.ВидОперации = Выборка.ХозяйственнаяОперация;

					Для каждого Реквизит Из НаборРеквизитов Цикл
						Если Не ЗначениеЗаполнено(Реквизит.Значение) Тогда
							Продолжить;
						КонецЕсли;
						Если СтрНайти(Реквизит.Ключ, "РасшифровкаПлатежа") Тогда
							ИмяРеквизита = Сред(Реквизит.Ключ, СтрДлина("РасшифровкаПлатежа") + 1);
						Иначе
							ИмяРеквизита = Реквизит.Ключ;
						КонецЕсли;
						СтрокаДокумента[ИмяРеквизита] = Реквизит.Значение;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		Иначе
			СтрокиПоискаШаг3.Добавить(СтрокаДокумента);
		КонецЕсли;
	КонецЦикла;

	Если Не СтрокиПоискаШаг3.Количество() Тогда
		Возврат;
	КонецЕсли;

	// Шаг 3. Зеркальный платеж
	УсловиеИсходящие = "
	|	ДанныеДокумента.БанковскийСчет = &СчетКонтрагента
	|	И (ДанныеДокумента.БанковскийСчетКонтрагента = &БанковскийСчет
	|		ИЛИ ДанныеДокумента.БанковскийСчетПолучатель = &БанковскийСчет)
	|	И ДанныеДокумента.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоставщику),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию)
	|	)
	|	И ДанныеДокумента.Проведен
	|";

	УсловиеВходящие = "
	|	ДанныеДокумента.БанковскийСчет = &СчетКонтрагента
	|	И (ДанныеДокумента.БанковскийСчетКонтрагента = &БанковскийСчет
	|		ИЛИ ДанныеДокумента.БанковскийСчетОтправитель = &БанковскийСчет)
	|	И ДанныеДокумента.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойОрганизации)
	|	)
	|	И ДанныеДокумента.Проведен
	|";

	СтрокиПоискаШаг4 = Новый Массив;

	Для каждого СтрокаДокумента Из СтрокиПоискаШаг3 Цикл

		Если СтрокаДокумента.Исходящий Тогда
			Запрос.Текст = ТекстЗапросаВходящие;
			ТекстУсловия = УсловиеВходящие;
			Реквизиты = РеквизитыХозОперацийПоступления;
		Иначе
			Запрос.Текст = ТекстЗапросаИсходящие;
			ТекстУсловия = УсловиеИсходящие;
			Реквизиты = РеквизитыХозОперацийСписания;
		КонецЕсли;

		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условие", ТекстУсловия);
		Запрос.УстановитьПараметр("СчетКонтрагента", СтрокаДокумента.СчетКонтрагента);

		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда

			НаборРеквизитов = Реквизиты.Получить(Выборка.ХозяйственнаяОперация);
			Если НаборРеквизитов <> Неопределено Тогда

				ЗаполнитьЗначенияСвойств(НаборРеквизитов, Выборка);

				СтрокаДокумента.НайденОбразец = Истина;
				СтрокаДокумента.Образец = Выборка.Ссылка;

				Если Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоставщику Тогда
					СтрокаДокумента.ВидОперации = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика;
				ИначеЕсли Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию Тогда
					СтрокаДокумента.ВидОперации = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтДругойОрганизации;
				ИначеЕсли Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаДенежныхДокументовПодотчетнику Тогда
					СтрокаДокумента.ВидОперации = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтПодотчетника;
				КонецЕсли;

				Если Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента Тогда
					СтрокаДокумента.ВидОперации = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту;
				ИначеЕсли Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойОрганизации Тогда
					СтрокаДокумента.ВидОперации = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию;
				КонецЕсли;

				Для каждого Реквизит Из НаборРеквизитов Цикл
					Если Не ЗначениеЗаполнено(Реквизит.Значение) Тогда
						Продолжить;
					КонецЕсли;
					Если СтрНайти(Реквизит.Ключ, "РасшифровкаПлатежа") Тогда
						ИмяРеквизита = Сред(Реквизит.Ключ, СтрДлина("РасшифровкаПлатежа") + 1);
					Иначе
						ИмяРеквизита = Реквизит.Ключ;
					КонецЕсли;
					СтрокаДокумента[ИмяРеквизита] = Реквизит.Значение;
				КонецЦикла;
			КонецЕсли;
		Иначе
			СтрокиПоискаШаг4.Добавить(СтрокаДокумента);
		КонецЕсли;
	КонецЦикла;

	Если Не СтрокиПоискаШаг4.Количество() Тогда
		Возврат;
	КонецЕсли;

	// Шаг 4. Зеркальный платеж: поступление сконвертированной валюты

	УсловиеИсходящие = "
	|	ДанныеДокумента.БанковскийСчет = &СчетКонтрагента
	|	И (ДанныеДокумента.БанковскийСчетКонтрагента = &БанковскийСчет
	|		ИЛИ ДанныеДокумента.БанковскийСчетПолучатель = &БанковскийСчет)
	|	И ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КонвертацияВалюты)
	|	И ДанныеДокумента.ИдентификаторПлатежа <> """"
	|	И ДанныеДокумента.Проведен
	|";

	Для каждого СтрокаДокумента Из СтрокиПоискаШаг4 Цикл

		Если СтрокаДокумента.Исходящий Тогда
			Продолжить;
		Иначе
			Запрос.Текст = ТекстЗапросаИсходящие;
			ТекстУсловия = УсловиеИсходящие;
		КонецЕсли;

		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условие", ТекстУсловия);
		Запрос.УстановитьПараметр("СчетКонтрагента", СтрокаДокумента.СчетКонтрагента);

		ДокументыКонвертации = Запрос.Выполнить().Выгрузить();

		Если ДокументыКонвертации.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;

		СписокУИП = ДокументыКонвертации.ВыгрузитьКолонку("ИдентификаторПлатежа");
		ДанныеДокументов = ДенежныеСредстваСервер.ОснованияОперацииКонвертацииПоУИП(СписокУИП, ТекущаяДатаСеанса());

		Для Каждого ДанныеДокумента Из ДанныеДокументов Цикл

			Если ДанныеДокумента.СуммаКонвертации > 0 Тогда

				СтрокаДокумента.НайденоОснованиеПлатежа = Истина;
				СтрокаДокумента.НайденКонтрагент = Истина;
				СтрокаДокумента.СоздаватьКонтрагента = Ложь;
				СтрокаДокумента.ВидОперации = Перечисления.ХозяйственныеОперации.КонвертацияВалюты;
				СтрокаДокумента.НайденОбразец = Истина;
				СтрокаДокумента.Образец = ДанныеДокумента.ОснованиеПлатежа;

				ЗаполнитьЗначенияСвойств(
				СтрокаДокумента,
				ДанныеДокумента, 
				"ИдентификаторПлатежа, Контрагент, Партнер, ОснованиеПлатежа, Подразделение, СтатьяДвиженияДенежныхСредств, ВалютаКонвертации, СуммаКонвертации");

			КонецЕсли;

		КонецЦикла;

	КонецЦикла;

КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьПартнеров")
Процедура Док_ЗаполнитьПартнеров(ДокументыКЗагрузке, ТаблицаДокументов, БанковскийСчет) Экспорт

	Организация = Справочники.БанковскиеСчетаОрганизаций.ПолучитьРеквизитыБанковскогоСчетаОрганизации(БанковскийСчет).Организация;

	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаДокументов.НомерСтроки,
	|	ТаблицаДокументов.Контрагент КАК Контрагент
	|
	|ПОМЕСТИТЬ ТаблицаДокументов
	|
	|ИЗ
	|	&ТаблицаДокументов КАК ТаблицаДокументов
	|ГДЕ
	|	ТаблицаДокументов.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|";

	Запрос.УстановитьПараметр("ТаблицаДокументов", ТаблицаДокументов);
	Запрос.Выполнить();

	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаДокументов.НомерСтроки,
	|	ВЫБОР КОГДА ДанныеСправочника.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка) ТОГДА
	|		ДанныеСправочника.Партнер
	|	КОГДА НЕ АналитикаУчетаПоПартнерам.Партнер ЕСТЬ NULL ТОГДА
	|		АналитикаУчетаПоПартнерам.Партнер
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.Партнеры.НеизвестныйПартнер)
	|	КОНЕЦ КАК Партнер
	|
	|ПОМЕСТИТЬ НайденныеПартнеры
	|ИЗ
	|	ТаблицаДокументов
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.Контрагенты КАК ДанныеСправочника
	|	ПО
	|		ДанныеСправочника.Ссылка = ТаблицаДокументов.Контрагент
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
	|		ПО
	|			АналитикаУчетаПоПартнерам.Контрагент = ДанныеСправочника.Ссылка
	|			И АналитикаУчетаПоПартнерам.Организация = &Организация
	|			И АналитикаУчетаПоПартнерам.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НайденныеПартнеры.НомерСтроки КАК НомерСтроки,
	|	НайденныеПартнеры.Партнер КАК Партнер,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Партнеры.ПрочиеОтношения, ЛОЖЬ) = ИСТИНА
	|				И ЕСТЬNULL(Партнеры.Клиент, ЛОЖЬ) = ЛОЖЬ
	|				И ЕСТЬNULL(Партнеры.Поставщик, ЛОЖЬ) = ЛОЖЬ
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПрочиеОтношения
	|ИЗ
	|	НайденныеПартнеры КАК НайденныеПартнеры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Партнеры
	|		ПО НайденныеПартнеры.Партнер = Партнеры.Ссылка";

	Запрос.УстановитьПараметр("Организация", Организация);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		СтрокаДокумента = ДокументыКЗагрузке.Найти(Выборка.НомерСтроки, "НомерСтроки");

		Если СтрокаДокумента <> Неопределено Тогда
			СтрокаДокумента.Партнер = Выборка.Партнер;
			СтрокаДокумента.ТолькоПрочиеОтношения = Выборка.ПрочиеОтношения;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры


&ИзменениеИКонтроль("ЗаполнитьРеквизитыСписания")
Процедура Док_ЗаполнитьРеквизитыСписания(ДокументыКЗагрузке, СтрокаДокумента, ДокументОбъект, СоздаватьКонтрагентов, ПроводитьДокументы, Префикс, ДоступныеСтатьиДДС)
	
	Перем РеквизитыВсе, РеквизитыХозОперации;
	
	// Контроль заявок
	Если Не (ДокументОбъект.ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.ИнкассовоеПоручение
		Или ДокументОбъект.ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.ПлатежныйОрдер
		Или ДокументОбъект.ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.БанковскийОрдер) Тогда
		ДокументОбъект.ОплатаПоЗаявкам = ПолучитьФункциональнуюОпцию("ИспользоватьЗаявкиНаРасходованиеДенежныхСредств")
			И Не ДенежныеСредстваСервер.РазрешеныПлатежиБезУказанияЗаявок(ДокументОбъект);
	Иначе
		КлиентБанкЛокализация.РазрешитьОплатуБезЗаявки(ДокументОбъект);
	КонецЕсли;
	
	КлиентБанкЛокализация.ЗаполнитьРеквизитыПлательщика(ДокументОбъект);
	
	Документы.СписаниеБезналичныхДенежныхСредств.ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(
		ДокументОбъект, РеквизитыВсе, РеквизитыХозОперации);
	
	// Контрагент
	Если РеквизитыХозОперации.Найти("Контрагент") <> Неопределено Тогда
		Если ЗначениеЗаполнено(СтрокаДокумента.Контрагент) Тогда
			УстановитьСвойство(ДокументОбъект, "Контрагент", СтрокаДокумента.Контрагент);
		ИначеЕсли СоздаватьКонтрагентов И СтрокаДокумента.СоздаватьКонтрагента Тогда
			УстановитьСвойство(ДокументОбъект, "Контрагент", СоздатьКонтрагента(ДокументыКЗагрузке, СтрокаДокумента));
		Иначе
			УстановитьСвойство(ДокументОбъект, "ИмяКонтрагента", СтрокаДокумента.ИмяКонтрагента);
		КонецЕсли;
	КонецЕсли;
	
	// Счет контрагента
	Если РеквизитыХозОперации.Найти("БанковскийСчетКонтрагента") <> Неопределено Тогда
		Если ЗначениеЗаполнено(СтрокаДокумента.СчетКонтрагента) Тогда
			УстановитьСвойство(ДокументОбъект, "БанковскийСчетКонтрагента", СтрокаДокумента.СчетКонтрагента);
		ИначеЕсли ЗначениеЗаполнено(ДокументОбъект.Контрагент) Тогда
			УстановитьСвойство(ДокументОбъект, "БанковскийСчетКонтрагента",
				СоздатьБанковскийСчетКонтрагента(ДокументыКЗагрузке, СтрокаДокумента, ДокументОбъект.Контрагент));
		КонецЕсли;
	КонецЕсли;
	
	// Подотчетное лицо
	Если РеквизитыХозОперации.Найти("ПодотчетноеЛицо") <> Неопределено Тогда
		Если СтрокаДокумента.НайденКонтрагент Тогда
			УстановитьСвойство(ДокументОбъект, "ПодотчетноеЛицо", СтрокаДокумента.Контрагент);
		Иначе
			УстановитьСвойство(ДокументОбъект, "ПодотчетноеЛицо", СтрокаДокумента.ПодотчетноеЛицо);
		КонецЕсли;
	КонецЕсли;
	
	Если РеквизитыХозОперации.Найти("ДатаАвансовогоОтчета") <> Неопределено Тогда
		УстановитьСвойство(ДокументОбъект, "ДатаАвансовогоОтчета",
			?(ЗначениеЗаполнено(ДокументОбъект.Дата), ДокументОбъект.Дата, ТекущаяДатаСеанса()) + 7 * 24 * 3600);
	КонецЕсли;
	
	// Банковский счет получатель
	Если РеквизитыХозОперации.Найти("БанковскийСчетПолучатель") <> Неопределено Тогда
		УстановитьСвойство(ДокументОбъект, "БанковскийСчетПолучатель", СтрокаДокумента.СчетКонтрагента);
	КонецЕсли;
	
	// Прочие реквизиты
	ЗаполнитьЗначенияСвойств(ДокументОбъект, СтрокаДокумента,
		"СтатьяДвиженияДенежныхСредств, Подразделение, КассаПолучатель");
	
	КлиентБанкЛокализация.ЗаполнитьРеквизитыСписания(СтрокаДокумента, ДокументОбъект, ДоступныеСтатьиДДС);
	#Вставка 
	   Док_ЗаполнитьРеквизитыСписанияПосле(СтрокаДокумента, ДокументОбъект, ПроводитьДокументы);
	#КонецВставки
	
	// Расшифровка платежа
	ЗаполнитьРасшифровкуСписания(СтрокаДокумента, ДокументОбъект, РеквизитыХозОперации, ПроводитьДокументы, ДоступныеСтатьиДДС);
	
КонецПроцедуры 


//&После("ЗаполнитьРеквизитыСписания")  в этой процедуре нет Параметра ПроводитьДокументы!!! Перенесла из общего модуля КлиентБанкЛокализация
Процедура Док_ЗаполнитьРеквизитыСписанияПосле(СтрокаДокумента, ДокументОбъект, ПроводитьДокументы)
	Документы.СписаниеБезналичныхДенежныхСредств.ПодобратьТипНалога(ДокументОбъект);     
	Обработки.КлиентБанк.ЗаполнитьОснованиеПлатежа(ДокументОбъект, СтрокаДокумента, "Списание", ПроводитьДокументы);  //Здесь нужен Параметр ПроводитьДокументы
КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьОбъектРасчетовПлатежаПоДоговору")
Процедура Док_ЗаполнитьОбъектРасчетовПлатежаПоДоговору(СтрокаПлатежа, ОбъектыРасчетовПоДоговорам, Отбор)

	Если Отбор.Приоритет > 4 Тогда
		Возврат;
	КонецЕсли;

	СписокОбъектовРасчетов = ОбъектыРасчетовПоДоговорам.НайтиСтроки(Отбор);

	Если СписокОбъектовРасчетов.Количество() = 1 Тогда

		СтрокаПлатежа.ОбъектРасчетов = СписокОбъектовРасчетов[0].ОбъектРасчетов;
		СтрокаПлатежа.ДоговорССамозанятым = СписокОбъектовРасчетов[0].ДоговорССамозанятым;
		СтрокаПлатежа.Договор = СписокОбъектовРасчетов[0].Договор;
		
		#Удаление
		Если ЗначениеЗаполнено(СписокОбъектовРасчетов[0].СтатьяДвиженияДенежныхСредств) Тогда
			СтрокаПлатежа.СтатьяДвиженияДенежныхСредств = СписокОбъектовРасчетов[0].СтатьяДвиженияДенежныхСредств;
		КонецЕсли;
		#КонецУдаления

	ИначеЕсли СписокОбъектовРасчетов.Количество() = 0 Тогда

		Отбор.Вставить("Приоритет", Отбор.Приоритет + 1);
		ЗаполнитьОбъектРасчетовПлатежаПоДоговору(СтрокаПлатежа, ОбъектыРасчетовПоДоговорам, Отбор);

	КонецЕсли;

КонецПроцедуры
